#

"""Lesson notes from 22.07.2024г."""

# Урок был посвещен изучению алгоритмов принятия и отправки домашней работы.
# Для того чтобы принять домашнюю работу необхдимо: зайти на GitHub, нажать на Fetch origin затем нажать на Pull origin. Далее идем в историю.
# Для того, чтобы отправить домашнюю работу необходимо: зайти на GitHub, нажать на вкладку "Изменения", выделить тему, которую хотим отправить, в поле "Коммиты" записать наименовани е коммита. После в терменале запустить проверку на линтеры, набрав pre-commit run --all-files. Нажать commit to main. Затем нажать на вкладку Push origin, затем нажать на Fetch
#

# В списке стэш changes  идут на коммит, в списке  changes не трекаются, гит статус должно показывать зеленый
